main_menu = ['Главное меню',
             'Открыть файл',
             'Сохранить файл',
             'Показать все контакты',
             'Добавить контакт',
             'Найти контакт',
             'Изменить контакт',
             'Удалить контакт',
             'Выход']

select_menu = 'Выберите пункт меню: '

input_error = f'Ошибка ввода. Введите число от 1 до {len(main_menu)-1}: '

new_contact = {'name': 'Введите имя контакта: ','phone': 'Введите телефон: ', 'comment': 'Введите комментарий: '}

empty_book = 'Телефонная книга пуста или не открыта'

load_successful = 'Телефонная книга успешно загружена'
error_load = 'Ошибка загрузки телефонной книги!'
save_successful = 'Телефонная книга успешно сохранена'
error_save = 'Ошибка сохранения телефонной книги!'
delete_successful = 'Контакт успешно удален!'
delete_error = 'Контакт с таким ID не найден!'
change_contact = 'Введите ID контакта для изменения: '
exit_menu = 'До свидания! Хорошего вам дня ;)'
def add_successful(name: str) -> str:
    return f'Контакт {name} успешно добавлен в книгу!'

search_word = 'Введите строку для поиска: '
delete_word = 'Какой контакт удалить? Введите ID: '
def empty_search(word: str) -> str:
    return f'Контакты содержащие {word} не найдены!'